{
  "five_star_reviews": [
    {
      "text": "Doug was absolutely fantastic. Great service and fixed our water leak & issue in no time! 10/10 recommend!",
      "reviewer_name": "Anonymous",
      "date": "2025-02-10T21:22:44.830Z"
    },
    {
      "text": "I highly recommend Doug and 1st call plumbing!! He is very dependable, professional, hardworking, and personable!!! I am thrilled to find a plumber that I can depend on! I will definitely use him again in the future!!",
      "reviewer_name": "Anonymous",
      "date": "2025-02-06T16:04:26.215Z"
    },
    {
      "text": "Doug has been my plumber for a few years now. He is very pleasant to work with. Everytime he has been here to work he has done an amazing job. I recommend him for all your plumbing needs. His pricing is very competitive and his work is very neat and complete.  We highly recommend 1st Call Plumbing.",
      "reviewer_name": "Anonymous",
      "date": "2025-01-15T20:46:02.453Z"
    },
    {
      "text": "Great service!!",
      "reviewer_name": "Anonymous",
      "date": "2025-01-09T05:56:07.679Z"
    },
    {
      "text": "Doug was very easy to work with. We had a    problem with our water under a concrete slab. We dug it out, he fixed the problem, and he stayed until we got it back together to ensure that everything was okay. He was efficient, effective, and very reasonably priced! We will continue to use him if any other needs arise!",
      "reviewer_name": "Anonymous",
      "date": "2025-01-04T18:52:43.180Z"
    },
    {
      "text": "1st Call Plumbing was very professional when I had plumbing problems.. 1st Call Plumbing diagnosed and fixed the problem in a very timely manner  and done the job for a lot less than anyone else I contacted.. AAAAA+++++++ 1st Call Plumbing is the only Plumbing Service I will use in the future..",
      "reviewer_name": "Anonymous",
      "date": "2024-12-29T17:59:20.821Z"
    },
    {
      "text": "Showed up when he said he was going to, worked fast, efficient , explained my issues and had them fixed with preventative ideas and more than enough information to help my home. Me and my family have working toilets again and that’s a thank you I cannot express\n\nFirst call everytime !!",
      "reviewer_name": "Anonymous",
      "date": "2024-12-29T17:21:01.688Z"
    },
    {
      "text": "Excellent work, timely, honest, and reliable!!  I would recommend 1st Call Plumbing, without any hesitation!!!",
      "reviewer_name": "Anonymous",
      "date": "2024-12-26T18:07:01.699Z"
    },
    {
      "text": "Had a plumbing issue on a Sunday and Doug arrived within 30 minutes to help! Very knowledgable and even took time to explain to us what was going on and how to prevent issues in the future.. Got us back up and running in no time. Will definitely be using him going forward!",
      "reviewer_name": "Anonymous",
      "date": "2024-12-15T23:48:02.055Z"
    },
    {
      "text": "This was my first time using this company and I am beyond impressed. The job was done in a timely and affordable fashion and on a Saturday!! I was given all the facts about the job at hand and some issues to keep an eye on. I really appreciated the transparency. I will definitely be making 1st call my first call for all my plumbing needs!! Thank you so much!!",
      "reviewer_name": "Anonymous",
      "date": "2024-12-08T01:41:16.303Z"
    },
    {
      "text": "Amazing service, came quicker than expected, and very friendly. Cleaned up job area very well too!  highly recommend!",
      "reviewer_name": "Anonymous",
      "date": "2024-12-03T20:52:04.053Z"
    },
    {
      "text": "Quick service and got the job done early. We were selling and had some pluming issues to be resolved. Doug got right on the call and made sure issues were resolved same day. Can’t say enough great things about 1st Call!!",
      "reviewer_name": "Anonymous",
      "date": "2024-11-30T19:42:15.815Z"
    },
    {
      "text": "I have used Doug for several years for my plumbing needs and such an honest, hardworking guy. He knows his stuff well and it reflects in his organization while working and the respect he shows his client's homes. I highly recommend him to anyone needing this kind of service! I can not say enough good!",
      "reviewer_name": "Anonymous",
      "date": "2024-11-30T17:09:18.872Z"
    },
    {
      "text": "I called 1st Call Plumbing at 8pm on a Friday evening with a plumbing emergency (when my washing machine spun, water would pour out from under my toilet and flood the bathroom) Doug answered immediately and he was here within 30 minutes (I’m in Paragould and he was in Jonesboro) This was not an easy job due to the location of the clean outs (which weren’t even on this property) but Doug worked tirelessly in the dark to get to the bottom of this rental property’s plumbing issue. He located the clean outs hundreds of feet from the house and got it cleaned out. He was very professional, knowledgeable, cleaned up after himself, and was thorough in his work. I highly recommend him for any and all of your plumbing needs in northeast Arkansas. I can’t express how grateful I am for his help!",
      "reviewer_name": "Anonymous",
      "date": "2024-11-23T05:22:05.771Z"
    },
    {
      "text": "Fast response and Great service.  Always willing to help.  Always friendly",
      "reviewer_name": "Anonymous",
      "date": "2024-10-16T00:20:47.548Z"
    },
    {
      "text": "I was so grateful to run up on this listing on an early Saturday morning after waiting all week for several plumbers to return my phone call or show up one call in and he called me right back and pulled up and resolved my issues with no problems great work ethic and loving personalities from him and his wife thru the phone will recommend him and continue to use his services DOUG IS THE GREATEST",
      "reviewer_name": "Anonymous",
      "date": "2024-07-13T15:39:50.423Z"
    },
    {
      "text": "Could not be happier with 1st call. They go above and beyond to help me when needed no matter what time of day or week. My highest possible recommendation.",
      "reviewer_name": "Anonymous",
      "date": "2024-06-17T02:29:24.486Z"
    },
    {
      "text": "The owner, Doug was quick to respond and came out the same day. He went right to work but did not mind answering all of my questions! You won’t go wrong calling 1st call ☎️",
      "reviewer_name": "Anonymous",
      "date": "2024-05-30T21:36:22.344Z"
    },
    {
      "text": "Doug Parks with 1st Call Plumbing is great!  A true professional, very knowlegeable and reliable!",
      "reviewer_name": "Anonymous",
      "date": "2024-05-22T21:33:07.906Z"
    },
    {
      "text": "Doug is awesome! I'm an engineer and do-it-yourselfer and he spent a lot of time answering my questions.  He is intelligent and does great work.  I really appreciate a professional taking the time to explain things.  Time is money, but he makes the customer feel worth his time.  I will definitely continue to use him for all my plumbing needs.  I can't recommend him highly enough!",
      "reviewer_name": "Anonymous",
      "date": "2024-05-17T14:01:26.920Z"
    },
    {
      "text": "Great work, fast and very trustworthy! I’ve recommended him to multiple people, and he’s great with working with you on any project! Don’t waste your money on others. Go with Doug!",
      "reviewer_name": "Anonymous",
      "date": "2024-05-16T18:36:14.162Z"
    },
    {
      "text": "Doug is the Best! I have been using Doug for a little over a year now and he has basically done it all for me. Water heaters, toilet issues, sink issues and emergency leaks that had to be addressed immediately! Doug is very responsive, hard worker, friendly, a fast and high quality plumber!",
      "reviewer_name": "Anonymous",
      "date": "2024-05-15T21:47:06.396Z"
    }
  ]
}