{
  "five_star_reviews": [
    {
      "text": "Great work great price explained what he was doing and why will be my only choice for any plumbing needs",
      "reviewer_name": "Anonymous",
      "date": "2024-05-30T23:33:41.278Z"
    },
    {
      "text": "Brandon did an excellent job replacing old shower faucet. He was very prompt, and courteous. His pricing was very fair and reasonable. We will certainly be using 1st Call Plumbing for any future plumbing repairs!",
      "reviewer_name": "Anonymous",
      "date": "2024-05-07T02:22:01.046Z"
    },
    {
      "text": "The most professional and kind home repairman I’ve ever had. Not only does Brandon do great work but makes sure you understand why and how he is doing what he is doing through the whole process. Never once was I worried about the process.",
      "reviewer_name": "Anonymous",
      "date": "2023-09-18T12:06:41.258Z"
    },
    {
      "text": "Fast and friendly service. Very happy with the repairs.",
      "reviewer_name": "Anonymous",
      "date": "2023-07-30T19:23:21.086Z"
    },
    {
      "text": "Prompt, polite, and priced right",
      "reviewer_name": "Anonymous",
      "date": "2023-06-26T20:24:44.898Z"
    },
    {
      "text": "Very neat & professional . Was very nice and did everything to make sure the best of his quality . Definitely using him again 🤜🏾🤛🏾",
      "reviewer_name": "Anonymous",
      "date": "2022-12-31T20:50:00.642Z"
    },
    {
      "text": "It's truly difficult finding honest people who are willing to provide quality services you can trust. Brandon was able to provide me a service when I was in need of help during a busy christmas break. He is very friendly and easy to talk to. Answered any questions I had without frustration.",
      "reviewer_name": "Anonymous",
      "date": "2022-12-30T20:06:09.499Z"
    },
    {
      "text": "Very satisfied with service and professional attitude towards the problem.",
      "reviewer_name": "Anonymous",
      "date": "2021-11-12T15:21:42.888Z"
    },
    {
      "text": "Brandon did a great job and was able to squeeze me in between jobs!!! I highly recommend this company!!!",
      "reviewer_name": "Anonymous",
      "date": "2021-08-05T22:27:38.663Z"
    },
    {
      "text": null,
      "reviewer_name": "Anonymous",
      "date": "2021-08-04T23:58:22.424Z"
    },
    {
      "text": "Brandon Did awesome job would recommend to anyone who is looking for a awesome plumber and Brandon makes sure everything thing was good before he left and cleaned up before leaving too Ty Brandon.",
      "reviewer_name": "Anonymous",
      "date": "2021-04-12T22:20:15.786Z"
    },
    {
      "text": null,
      "reviewer_name": "Anonymous",
      "date": "2021-03-26T01:36:32.103Z"
    },
    {
      "text": "They did a great job. They quickly worked me into his schedule after business hours. They did excellent work and provided great customer service.",
      "reviewer_name": "Anonymous",
      "date": "2021-03-03T03:20:13.547Z"
    },
    {
      "text": "Brandon came out quickly and after business hours like we needed. He did the job for less than he originally quoted and did a great job! We will use him next time we need work done!  We highly recommend.",
      "reviewer_name": "Anonymous",
      "date": "2021-02-21T19:18:52.677Z"
    },
    {
      "text": "Best plumber!  Always reliable and reasonable rates as well.",
      "reviewer_name": "Anonymous",
      "date": "2020-11-13T01:54:37.951Z"
    },
    {
      "text": "Brandon answered my call on the 2nd ring. He got here right on time and had us fixed up in no time at all. VERY professional and friendly service! Would recommend to anyone, anytime!",
      "reviewer_name": "Anonymous",
      "date": "2020-04-25T16:51:36.421Z"
    },
    {
      "text": "Excellent service! Great price for high quality work! Definitely recommend.",
      "reviewer_name": "Anonymous",
      "date": "2020-04-07T22:47:20.599Z"
    },
    {
      "text": "Brandon did a great job and helped us out when we were in a bind. Came out promptly and replaced our water heater in a couple hours, that day. Also gave us a great price for high quality work.",
      "reviewer_name": "Anonymous",
      "date": "2019-09-10T00:57:45.058Z"
    },
    {
      "text": "Great response time, knowledgeable,  reasonable.   Really appreciated Brandon coming to the rescue!",
      "reviewer_name": "Anonymous",
      "date": "2019-07-14T21:58:51.702Z"
    },
    {
      "text": "Very dependable",
      "reviewer_name": "Anonymous",
      "date": "2019-04-01T15:59:06.399Z"
    },
    {
      "text": "Awesome company! Came out within minutes of me calling (at night, on a weekend). I will definitely use this company in the future!",
      "reviewer_name": "Anonymous",
      "date": "2018-12-31T22:27:33.735Z"
    },
    {
      "text": "I was having an issue with a leak around my toilet. Brandon and 1st Call Plumbing responded quickly to help out. He attempted several different solutions to get the leak to stop, making multiple trips to the hardware store. He then explained to me why those options weren't working, and what he recommended to fix the problem. He even took the time to show me where the issue was and explained what he had tried previously in detail. We finally decided on replacing the unit all together, which he took care of and had installed quickly.\n\nVery reasonably price. Thorough. Timely.\nFantastic Job. I would recommend his work again to anyone!",
      "reviewer_name": "Anonymous",
      "date": "2018-07-19T04:51:48.251Z"
    },
    {
      "text": "Brandon has ALWAYS gone above and beyond to fix things and get them right! A Southern gentleman, neat and clean, doing a job that no one else wants to do.  I HIGHLY recommend his services, he's worth every penny !",
      "reviewer_name": "Anonymous",
      "date": "2018-05-30T05:06:00.060Z"
    },
    {
      "text": "Blake is great guy, who does great work. Awesome customer service. Highly recommend!!",
      "reviewer_name": "Anonymous",
      "date": "2018-05-29T16:44:08.802Z"
    },
    {
      "text": "Was having problems getting a good guy out to get me hooked up. Showed up on time and took care of me. I would recommend to anyone. In fact he as already done work for some clients and they r very pleased.",
      "reviewer_name": "Anonymous",
      "date": "2018-05-16T22:12:38.445Z"
    },
    {
      "text": "Great guy, great service. I wish I had called him first, I spent more money trying to fix it myself than what he charged. Highly recommend.",
      "reviewer_name": "Anonymous",
      "date": "2018-05-10T01:06:06.157Z"
    },
    {
      "text": null,
      "reviewer_name": "Anonymous",
      "date": "2018-02-20T00:15:52.002Z"
    },
    {
      "text": "Brandon with 1st Call Plumbing and Rooter Service was fantastic to work with. He accepted a cold call job and was willing to come take a look at what we had going on with our natural gas lines and plumbing lines in the bathroom.\n\nHe was very up front with his prices and explanation of services. He made a smart move by quoting the job as a \"worst case scenario\" which gave my wife and I an opportunity to make an informed decision. He was able to complete the job very quickly and at a reasonable rate per hour, I feel like he met and went beyond our expectations for the service he provided.\n\nHe was courteous to me over the phone, respectful to my wife and great with my kiddo as he watched what was going on. There was no doubt in my mind that he appreciated having the work, and he made us feel like our needs were of utmost importance - which we were thankful for as we are new homeowners just figuring out how to take care of our new homes features.\n\nI would highly recommend him and his services for whatever your plumbing needs may be. I will for sure be contacting him again with any future projects!\n\nThank you, Brandon. God bless.\n\n- A satisfied customer",
      "reviewer_name": "Anonymous",
      "date": "2017-12-18T19:54:22.171Z"
    },
    {
      "text": "Thank you. Very honest. And great work. Came the same day and fixed an ongoing problem.",
      "reviewer_name": "Anonymous",
      "date": "2017-11-15T22:37:24.586Z"
    },
    {
      "text": null,
      "reviewer_name": "Anonymous",
      "date": "2017-11-03T15:32:49.499Z"
    }
  ]
}